In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":["vipul","ankit","naman","shivam"],
    "mark":[63,34,45,42],
    "city":["mainprui","rampur","kanpur","bareily"]
}

In [3]:
df1=pd.DataFrame(dict1)

In [4]:
df1

     name  mark      city
0   vipul    63  mainprui
1   ankit    34    rampur
2   naman    45    kanpur
3  shivam    42   bareily

In [5]:
df1.to_csv('my_marks.csv')

to remove index from csv file
df1.to_csv('my_marks.csv',index=false)

In [6]:
df1.head(2)

    name  mark      city
0  vipul    63  mainprui
1  ankit    34    rampur

In [7]:
df1.tail(2)

     name  mark     city
2   naman    45   kanpur
3  shivam    42  bareily

head(x) gives x rows of starting  and tail(x) gives x rows of end

In [8]:
df1.describe()

            mark
count   4.000000
mean   46.000000
std    12.247449
min    34.000000
25%    40.000000
50%    43.500000
75%    49.500000
max    63.000000

gives the statical analysis of numeric columns

------------------------------------------------------------------------------

reading the csv file

In [9]:
data = pd.read_csv('my_marks.csv')

In [10]:
data

   Unnamed: 0    name  mark      city
0           0   vipul    63  mainprui
1           1   ankit    34    rampur
2           2   naman    45    kanpur
3           3  shivam    42   bareily

Pandas is a library written in python which uses numpy for faster data analysis while numpy is written in c

Pandas has two types of data stracture. 1-> series (one diemsional array with index) 2->DataFrame (2D data sheet)

creating random data

In [11]:
ser = pd.Series(np.random.rand(34))

In [12]:
type(ser)

pandas.core.series.Series

In [13]:
newdf = pd.DataFrame(np.random.rand(200,6),index=np.arange(200))

In [14]:
type(newdf)

pandas.core.frame.DataFrame

In [15]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
5    float64
dtype: object

In [16]:
newarray = newdf.to_numpy()

In [17]:
newarray

array([[0.02963174, 0.25244568, 0.19397106, 0.13404608, 0.9008534 ,
        0.17146253],
       [0.11587259, 0.71647326, 0.31360163, 0.71880372, 0.99672336,
        0.16714549],
       [0.31390098, 0.37114247, 0.04406112, 0.28388465, 0.90614091,
        0.70909566],
       ...,
       [0.70761665, 0.82184188, 0.09382705, 0.57106139, 0.44573857,
        0.60789907],
       [0.09815374, 0.4515138 , 0.60208339, 0.29440962, 0.66161294,
        0.6922661 ],
       [0.25132862, 0.81834102, 0.04150856, 0.57259944, 0.67484866,
        0.65131325]])

In [18]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,190,191,192,193,194,195,196,197,198,199
0,0.029632,0.115873,0.313901,0.173606,0.010015,0.706223,0.540923,0.281827,0.159059,0.350555,...,0.815041,0.637800,0.363884,0.230567,0.513475,0.840510,0.572587,0.707617,0.098154,0.251329
1,0.252446,0.716473,0.371142,0.077227,0.453662,0.734071,0.276749,0.990167,0.946768,0.713846,...,0.184737,0.471196,0.880213,0.279175,0.929391,0.844503,0.806236,0.821842,0.451514,0.818341
2,0.193971,0.313602,0.044061,0.421704,0.068844,0.400351,0.674476,0.981962,0.350824,0.503251,...,0.936159,0.014450,0.936894,0.537613,0.011399,0.471896,0.793550,0.093827,0.602083,0.041509
3,0.134046,0.718804,0.283885,0.597297,0.998491,0.444395,0.634950,0.180517,0.886590,0.618567,...,0.499318,0.480331,0.824745,0.677493,0.703232,0.998352,0.072354,0.571061,0.294410,0.572599
4,0.900853,0.996723,0.906141,0.231809,0.801819,0.272849,0.858997,0.755035,0.396968,0.359653,...,0.245551,0.789896,0.322948,0.500598,0.747117,0.610578,0.241396,0.445739,0.661613,0.674849
5,0.171463,0.167145,0.709096,0.785496,0.585366,0.727112,0.677807,0.526039,0.787793,0.052653,...,0.493484,0.529254,0.070375,0.565154,0.403931,0.623334,0.787685,0.607899,0.692266,0.651313

T gives the tranpose of dataframe

In [19]:
newdf.sort_index(axis=0,ascending=False).head()

            0         1         2         3         4         5
199  0.251329  0.818341  0.041509  0.572599  0.674849  0.651313
198  0.098154  0.451514  0.602083  0.294410  0.661613  0.692266
197  0.707617  0.821842  0.093827  0.571061  0.445739  0.607899
196  0.572587  0.806236  0.793550  0.072354  0.241396  0.787685
195  0.840510  0.844503  0.471896  0.998352  0.610578  0.623334

axis=0 for rows and axis=1 from colum

In [20]:
newdf.sort_index(axis=1,ascending=False).head()

          5         4         3         2         1         0
0  0.171463  0.900853  0.134046  0.193971  0.252446  0.029632
1  0.167145  0.996723  0.718804  0.313602  0.716473  0.115873
2  0.709096  0.906141  0.283885  0.044061  0.371142  0.313901
3  0.785496  0.231809  0.597297  0.421704  0.077227  0.173606
4  0.585366  0.801819  0.998491  0.068844  0.453662  0.010015

In [21]:
type(newdf[0])

pandas.core.series.Series

DataFrames are the combination of Series data type

In [22]:
newdf1 = newdf

it makes only view i.e both are points to same memory lcations. on change in newdf1 reflects to newdf also

In [23]:
newdf1 = newdf.copy()

it makes the copy

In [24]:
newdf1.loc[0,0]=0.0343333

update any value with loc[row,column]

In [25]:
newdf1.head()

          0         1         2         3         4         5
0  0.034333  0.252446  0.193971  0.134046  0.900853  0.171463
1  0.115873  0.716473  0.313602  0.718804  0.996723  0.167145
2  0.313901  0.371142  0.044061  0.283885  0.906141  0.709096
3  0.173606  0.077227  0.421704  0.597297  0.231809  0.785496
4  0.010015  0.453662  0.068844  0.998491  0.801819  0.585366

newdf1.columns = list("ABCDEF")

In [26]:
newdf1.columns = list("ABCDEF")

In [27]:
newdf1.head()

          A         B         C         D         E         F
0  0.034333  0.252446  0.193971  0.134046  0.900853  0.171463
1  0.115873  0.716473  0.313602  0.718804  0.996723  0.167145
2  0.313901  0.371142  0.044061  0.283885  0.906141  0.709096
3  0.173606  0.077227  0.421704  0.597297  0.231809  0.785496
4  0.010015  0.453662  0.068844  0.998491  0.801819  0.585366

In [28]:
newdf1=newdf1.drop('F',axis=1)

In [29]:
newdf1.head()

          A         B         C         D         E
0  0.034333  0.252446  0.193971  0.134046  0.900853
1  0.115873  0.716473  0.313602  0.718804  0.996723
2  0.313901  0.371142  0.044061  0.283885  0.906141
3  0.173606  0.077227  0.421704  0.597297  0.231809
4  0.010015  0.453662  0.068844  0.998491  0.801819

In [30]:
newdf1.loc[(newdf1['A']<0.5) & (newdf1['B']>0.5)].head(10)

           A         B         C         D         E
1   0.115873  0.716473  0.313602  0.718804  0.996723
7   0.281827  0.990167  0.981962  0.180517  0.755035
8   0.159059  0.946768  0.350824  0.886590  0.396968
9   0.350555  0.713846  0.503251  0.618567  0.359653
14  0.005509  0.672792  0.842656  0.513946  0.708062
18  0.251752  0.719281  0.805761  0.322393  0.343046
20  0.449801  0.637351  0.703766  0.720995  0.579840
22  0.393107  0.799724  0.833240  0.714663  0.690946
28  0.339011  0.739059  0.050555  0.600744  0.496720
29  0.231772  0.599668  0.154051  0.922927  0.674544

for indexinf use iloc instead of loc

In [31]:
newdf1.drop([1,3,5],axis=0,inplace=True)

In [32]:
newdf1.head()

          A         B         C         D         E
0  0.034333  0.252446  0.193971  0.134046  0.900853
2  0.313901  0.371142  0.044061  0.283885  0.906141
4  0.010015  0.453662  0.068844  0.998491  0.801819
6  0.540923  0.276749  0.674476  0.634950  0.858997
7  0.281827  0.990167  0.981962  0.180517  0.755035

In [33]:
newdf1.reset_index(drop=True).head()

          A         B         C         D         E
0  0.034333  0.252446  0.193971  0.134046  0.900853
1  0.313901  0.371142  0.044061  0.283885  0.906141
2  0.010015  0.453662  0.068844  0.998491  0.801819
3  0.540923  0.276749  0.674476  0.634950  0.858997
4  0.281827  0.990167  0.981962  0.180517  0.755035

reset_index reset the index after updating the dataframe